In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r"E:\Programming\Machine Learning\ML Algorithams\Naive Bayes\titanic.csv")

In [3]:
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [4]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)

In [5]:
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [6]:
target = df.Survived
inputs = df.drop('Survived', axis='columns')

In [7]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female   male
0   False   True
1    True  False
2    True  False
3    True  False
4   False   True

In [8]:
inputs = pd.concat([inputs, dummies], axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female   male
0       3    male  22.0   7.2500   False   True
1       1  female  38.0  71.2833    True  False
2       3  female  26.0   7.9250    True  False
3       1  female  35.0  53.1000    True  False
4       3    male  35.0   8.0500   False   True

I am dropping male column as well because of dummy variable trap theory. One column is enough to repressent male vs female

In [9]:
inputs.drop(['Sex', 'male'],axis='columns', inplace=True)
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500   False
1       1  38.0  71.2833    True
2       3  26.0   7.9250    True
3       1  35.0  53.1000    True
4       3  35.0   8.0500   False

In [10]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [11]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [14]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female
0       3  22.000000   7.2500   False
1       1  38.000000  71.2833    True
2       3  26.000000   7.9250    True
3       1  35.000000  53.1000    True
4       3  35.000000   8.0500   False
5       3  29.699118   8.4583   False

In [15]:
from sklearn.model_selection import train_test_split

In [30]:
X_train, X_test, y_train, y_test = train_test_split(inputs, target, test_size=0.2)

In [31]:
len(X_train)

712

In [32]:
len(X_test)

179

In [33]:
len(inputs)

891

In [34]:
X_train

     Pclass        Age      Fare  female
609       1  40.000000  153.4625    True
527       1  29.699118  221.7792   False
713       3  29.000000    9.4833   False
727       3  29.699118    7.7375    True
171       3   4.000000   29.1250   False
..      ...        ...       ...     ...
825       3  29.699118    6.9500   False
563       3  29.699118    8.0500   False
13        3  39.000000   31.2750   False
603       3  44.000000    8.0500   False
127       3  24.000000    7.1417   False

[712 rows x 4 columns]

In [35]:
y_train

609    1
527    0
713    0
727    1
171    0
      ..
825    0
563    0
13     0
603    0
127    1
Name: Survived, Length: 712, dtype: int64

In [36]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [37]:
model.fit(X_train, y_train)

GaussianNB()

In [38]:
model.score(X_test, y_test)

0.8156424581005587

In [39]:
X_test[:10]

     Pclass        Age      Fare  female
151       1  22.000000   66.6000    True
598       3  29.699118    7.2250   False
244       3  30.000000    7.2250   False
195       1  58.000000  146.5208    True
604       1  35.000000   26.5500   False
778       3  29.699118    7.7375   False
343       2  25.000000   13.0000   False
611       3  29.699118    7.0500   False
303       2  29.699118   12.3500    True
56        2  21.000000   10.5000    True

In [40]:
y_test[:10]

151    1
598    0
244    0
195    1
604    1
778    0
343    0
611    0
303    1
56     1
Name: Survived, dtype: int64

In [43]:
model.predict(X_test[:10])

array([1, 0, 0, 1, 0, 0, 0, 0, 1, 1], dtype=int64)

In [44]:
model.predict_proba(X_test[:10])

array([[3.71629170e-02, 9.62837083e-01],
       [9.60855224e-01, 3.91447761e-02],
       [9.60975809e-01, 3.90241911e-02],
       [1.61437108e-04, 9.99838563e-01],
       [7.82235037e-01, 2.17764963e-01],
       [9.60972266e-01, 3.90277340e-02],
       [9.18755399e-01, 8.12446005e-02],
       [9.60813455e-01, 3.91865446e-02],
       [2.79760457e-01, 7.20239543e-01],
       [2.53942716e-01, 7.46057284e-01]])